# -*- mode: org; coding: utf-8-unix -*-
#+TITLE: My emacs configuration
#+AUTHOR: Jim Hansson
#+EMAIL: jim.hansson@gmail.com 
#+DATE: <2012-06-28 to>
#+LANGUAGE: English

This is my main .emacs file. It is responsible for calling out to the local file at
different points. This is placed in a git repository that I share between work and home

* Bugs
	:LOGBOOK:
	CLOCK: [2014-06-09 må 14:55]--[2014-06-09 må 16:40] =>  1:45
	- changed omnisharp to be from elpa instead of using my own version.
	:END:
*** TODO I don't want submodules to show up in git status
		:LOGBOOK:
		CLOCK: [2013-03-11 må 22:13]--[2013-03-11 må 22:52] =>  0:39
		:END:
*** TODO replace setq and other things with custom-set-variables calls
		:LOGBOOK:
		CLOCK: [2013-07-03 on 00:00]--[2013-07-03 on 00:39] =>  0:39
		:END:
		
		might allow for using custom for changing varibles?? also does require on things.

		seems that the function that i should use i customize-set-variable instead.

*** TODO advice tabify/untabify to use the whole buffer if no region is marked. :noexport:
		:LOGBOOK:
		CLOCK: [2014-02-05 on 12:15]--[2014-02-05 on 15:17] =>  3:02
		CLOCK: [2014-02-04 ti 12:15]--[2014-02-04 ti 15:50] =>  3:35
		:END:

		does not work at the moment as I would like it to need to fix it somehow.
		#+BEGIN_SRC elisp
      (defadvice tabify (around mark-whole-buffer-if-no-region activate)
        "When using tabify without marking a region, the normal thing in emacs is to do tabify
      on everthing below point, this feel unatural, this changes that to instead do it on the
      whole buffer."
        (save-excursion
          (if (not (region-active-p)) 
              (progn
                (mark-whole-buffer)
                (ad-do-it)))))
        
		#+END_SRC

		#+RESULTS:
		: tabify

		#+BEGIN_SRC elisp
		(ad-disable-advice 'tabify 'around 'mark-whole-buffer-if-no-region)
		#+END_SRC

  #+RESULTS:

***** DONE move my changes from pretty-mode.el to this file
			:LOGBOOK:
			- State "DONE"       from "TODO"       [2013-07-02 ti 23:45]
			CLOCK: [2013-07-02 ti 23:30]--[2013-07-02 ti 23:44] =>  0:14
			- moved my changes out from pretty-mode.el into this file, and replaced
        pretty-mode.el from emacswiki.
			:END:
*** Interaction log

		#+BEGIN_SRC emacs-lisp
      (require 'interaction-log)
      ;;(interaction-log-mode +1)
      
      (global-set-key [f1] (lambda () (interactive) (display-buffer ilog-buffer-name)))          
		#+END_SRC

  #+RESULTS:
	| lambda | nil | (interactive) | (display-buffer ilog-buffer-name) |
	
* Iswitch Buffers																																 :buffers:

	To prevent certain buffers from showing up in the completion list, set
	'iswitchb-buffer-ignore': (setq iswitchb-buffer-ignore '("^ " "*Buffer")) This one is
	useful if you want to lose the *...* special buffers from the list. It's helpful if
	you're using the JDEE for editing Java apps, as you end up with buffers named
	org.whatever.package.Class which you might want to eliminate: (setq
	iswitchb-buffer-ignore '("^\\*")) To prevent switching to another frame, you can add the
	following to your configuration: (setq iswitchb-default-method 'samewindow)

	#+BEGIN_SRC emacs-lisp
    (iswitchb-mode 1)
    ;; rebind the normal key for buffer list to ibuffer
    (global-set-key (kbd "C-x C-b") 'ibuffer)
    (setq ibuffer-expert t)
    (setq ibuffer-show-empty-filter-groups nil)
    (setq iswitchb-default-method 'samewindow)
    ;; in your .emacs will allow left/right artist--arrow key navigation of the
    ;; buffer list, and deactivate up/down in iswitchb. Note that you
    ;; can by default use C-s and C-r to do this.  If the
    ;; below fails with "define-key: Symbol's function definition is
    ;; void: edmacro-parse-keys" you need to load the package defining
    ;; edmacro with (require 'edmacro).
    (defun iswitchb-local-keys ()
      (mapc (lambda (K) 
              (let* ((key (car K)) (fun (cdr K)))
                (define-key iswitchb-mode-map (edmacro-parse-keys key) fun)))
            '(("<right>" . iswitchb-next-match)
              ("<left>"  . iswitchb-prev-match)
              ("<up>"    . ignore             )
              ("<down>"  . ignore             ))))
    (add-hook 'iswitchb-define-mode-map-hook 'iswitchb-local-keys)
	#+END_SRC

 #+RESULTS:
 | iswitchb-local-keys |

	
	#+BEGIN_SRC emacs-lisp
    (add-hook 'ibuffer-mode-hook 
              '(lambda ()
                 (ibuffer-auto-mode 1)
                 (ibuffer-switch-to-saved-filter-groups "home")))
    
    ;; Switching to ibuffer puts the cursor on the most recent buffer
    (defadvice ibuffer (around ibuffer-point-to-most-recent) ()
      "Open ibuffer with cursor pointed to most recent buffer name"
      (let ((recent-buffer-name (buffer-name)))
        ad-do-it
        (ibuffer-jump-to-buffer recent-buffer-name)))
    (ad-activate 'ibuffer)
    
    (defun switch-buffers-between-frames ()
      "switch-buffers-between-frames switches the buffers between the two last frames"
      (interactive)
      (let ((this-frame-buffer nil)
            (other-frame-buffer nil))
        (setq this-frame-buffer (car (frame-parameter nil 'buffer-list)))
        (other-frame 1)
        (setq other-frame-buffer (car (frame-parameter nil 'buffer-list)))
        (switch-to-buffer this-frame-buffer)
        (other-frame 1)
        (switch-to-buffer other-frame-buffer))) 
	#+END_SRC

 #+RESULTS:
 : switch-buffers-between-frames

	#+BEGIN_SRC emacs-lisp
    ;; Use human readable Size column instead of original one
    (setq ibuffer-inline-columns ())
    (define-ibuffer-column size-h
      (:name "Size" :inline t)
      (cond
       ((> (buffer-size) 1000) (format "%7.2f Kb" (/ (buffer-size) 1000.0)))
       ((> (buffer-size) 1000000) (format "%7.2f Mb" (/ (buffer-size) 1000000.0)))
       (t (format "%8d b" (buffer-size)))))
    
    ;; Modify the default ibuffer-formats
    (setq ibuffer-formats
          '((mark modified read-only " "
                  (name 20 20 :left :elide)
                  " "
                  (size-h 9 -1 :right)
                  " "
                  (mode 16 16 :left :elide)
                  " "
                  filename-and-process)
            (mark " "
                  (name 20 -1)
                  " " filename)))
	#+END_SRC

  #+RESULTS:
	| mark | modified | read-only    |   | (name 20 20 :left :elide) |   | (size-h 9 -1 :right) |   | (mode 16 16 :left :elide) |   | filename-and-process |
	| mark |          | (name 20 -1) |   | filename                  |   |                      |   |                           |   |                      |
	
	#+BEGIN_SRC emacs-lisp
    (setq ibuffer-saved-filter-groups
          '(("home"
             ("Emacs" (or (filename . ".emacs.d")
                          (filename . "emacs.org")
                          (filename . ".emacs")))
             ("Org" (or (filename . ".org")
                        (filename . "OrgMode")
                        (name . "*Org Agenda*")
                        (name . "diary")))
             ("code" (or (mode . csharp-mode)
                         (mode . c++-mode)
                         (mode . lisp-mode)
                         (mode . c-mode)))
             ("Web Dev" (or (mode . html-mode)
                            (mode . css-mode)))
             ("SQL" (or (filename . ".plb")
                        (filename . ".sql")
                        (filename . ".dbo")
                        (mode . sqli-mode)
                        (name . "*SQL*")))
             ("VC" (or (name . "\*svn")
                       (name . "\*magit")))
             ("ERC" (or (mode . erc-mode)
                        (mode . erc-list-mode)))
             ("gnus" (or
                      (mode . message-mode)
                      (mode . bbdb-mode)
                      (mode . mail-mode)
                      (mode . gnus-group-mode)
                      (mode . gnus-summary-mode)
                      (mode . gnus-article-mode)
                      (name . "^\\.bbdb$")
                      (name . "^\\.newsrc-dribble")))
             ("Custom" (mode . Custom-mode))
             ("Help" (or (name . "\*Help\*")
                         (name . "\*Apropos\*")
                         (name . "\*info\*"))))))
	 #+END_SRC

 #+RESULTS:
 | home | (Emacs (or (filename . .emacs.d) (filename . emacs.org) (filename . .emacs))) | (Org (or (filename . .org) (filename . OrgMode) (name . *Org Agenda*) (name . diary))) | (code (or (mode . csharp-mode) (mode . c++-mode) (mode . lisp-mode) (mode . c-mode))) | (Web Dev (or (mode . html-mode) (mode . css-mode))) | (SQL (or (filename . .plb) (filename . .sql) (mode . sqli-mode) (name . *SQL*))) | (VC (or (name . *svn) (name . *magit))) | (ERC (or (mode . erc-mode) (mode . erc-list-mode))) | (gnus (or (mode . message-mode) (mode . bbdb-mode) (mode . mail-mode) (mode . gnus-group-mode) (mode . gnus-summary-mode) (mode . gnus-article-mode) (name . ^\.bbdb$) (name . ^\.newsrc-dribble))) | (Custom (mode . Custom-mode)) | (Help (or (name . *Help*) (name . *Apropos*) (name . *info*))) |

	

*** Colours in buffer list																												 :faces:

		#+BEGIN_SRC emacs-lisp
      (setq ibuffer-fontification-alist
            '((1 (eq major-mode 'org-mode) (font-lock-keyword-face))
              (4 (eq buffer-file-name "~/diary") (font-lock-keywork-face)) ;; does not work??
              (2 (eq major-mode 'Custom-mode) (font-lock-preprocessor-face))
              (3 (eq major-mode 'erc-mode) (font-lock-string-face))))
		#+END_SRC

  #+RESULTS:
	| 1 | (eq major-mode (quote org-mode))    | (font-lock-keyword-face)      |
	| 4 | (eq buffer-file-name ~/diary)       | (font-lock-keywork-face)      |
	| 2 | (eq major-mode (quote Custom-mode)) | (font-lock-preprocessor-face) |
	| 3 | (eq major-mode (quote erc-mode))    | (font-lock-string-face)       |

***** SQL-mode

			First we need to associate oracles sql files with sql-mode, and deactiveate
			linewrapping, it's idiotic in sqli-mode

			#+BEGIN_SRC emacs-lisp
        (add-to-list 'auto-mode-alist '("\\.plb\\'" . sql-mode))
        (add-hook 'sql-interactive-mode-hook (lambda ()
                                               (toggle-truncate-lines 1)))
        (add-hook 'sql-interactive-mode-hook (lambda ()
                                               (setq comint-input-ring-name
                                                     (concat (sql-make-alternate-buffer-name)
                                                             ".history"))))
			#+END_SRC

   #+RESULTS:
	 | (lambda nil (setq comint-input-ring-name (concat (sql-make-alternate-buffer-name) .history))) | sql-rename-buffer | (lambda nil (toggle-truncate-lines 1)) |

***** nXML
			:LOGBOOK:
    	CLOCK: [2013-03-17 sö 12:08]--[2013-03-17 sö 12:23] =>  0:15
    	:END:

			First we need a local place to store all relax ng files used to validate and provide
			completion, that is synced between machines.
			
			#+BEGIN_SRC emacs-lisp
      	;; nxml is a part of the emacs distrobution so we don't need to have (when (require
      	;; .... 'noerror) around it, but we need to eval-after-load so the variable are
      	;; defined. 
      	
      	(eval-after-load "nxml-mode" 
        	'(add-to-list 'rng-schema-locating-files
                      	(concat local-emacs-org-dir "xml-schemas/schemas.xml")))
    	#+END_SRC

			We want completion and other fun stuff

			#+BEGIN_SRC emacs-lisp
      	;; just writing </ should be enaough to close last tag
      	;; ctrl tab to complete, this will do until we fixes w32 special keys things.
      	(eval-after-load "nxml-mode"
        	'(progn (setq nxml-slash-auto-complete-flag t)
                	(define-key nxml-mode-map (kbd "C-<tab>") 'nxml-complete)))
    	#+END_SRC

			#+BEGIN_SRC emacs-lisp
        (add-to-list 'auto-mode-alist '("\\.html$" . nxml-mode))
        (add-to-list 'auto-mode-alist '("\\.rng$" . nxml-mode))
        (add-to-list 'auto-mode-alist '("\\.rss$" . nxml-mode))
        (add-to-list 'auto-mode-alist '("\\.sch$" . nxml-mode))
        (add-to-list 'auto-mode-alist '("\\.svg$" . nxml-mode))
        (add-to-list 'auto-mode-alist '("\\.wsdl$" . nxml-mode))
        (add-to-list 'auto-mode-alist '("\\.xml$" . nxml-mode))
        (add-to-list 'auto-mode-alist '("\\.xsd$" . nxml-mode))
        (add-to-list 'auto-mode-alist '("\\.xsl$" . nxml-mode))
        (add-to-list 'auto-mode-alist '("\\.xslt$" . nxml-mode))
			#+END_SRC
******* TODO make it call msbuild in the right way, when building solutions.
				:LOGBOOK:
				CLOCK: [2013-10-02 on 19:55]--[2013-10-03 to 00:20] =>  4:25
				:END:
***** Lisp
			
			#+BEGIN_SRC emacs-lisp
        (require 'slime-autoloads)
        (load (expand-file-name "~/quicklisp/slime-helper.el"))
        (setq inferior-lisp-program "sbcl --noinform")
			#+END_SRC

   #+RESULTS:
	 : sbcl --noinform

***** Haskell
			#+BEGIN_SRC emacs-lisp
        (jiha-safe-require 'flymake-haskell-multi
                           (add-hook 'haskell-mode-hook 'flymake-haskell-multi-load))
        
			#+END_SRC

			#+RESULTS:
			| flymake-haskell-multi-load | (lambda (jiha-safe-require (quote inf-haskell) nil)) | turn-on-haskell-indent | turn-on-haskell-doc-mode |

*** Org Capture
		:LOGBOOK:
		CLOCK: [2013-03-28 to 22:48]--[2013-03-28 to 23:26] =>  0:38
		:END:
		
		This is needed by both the [[Org-outlook integration]] and by 
		[[Org Protocol]]. First some basic setup of org-capture.

		We need some good capture templates. remember that the template
		"key" need to be exactly one character long for it to work with
		org-protocol.

		org-capture-templates is a list with structs the tells how and
		where things shall be put. first we clear it then we use
		add-to-list to append template after template.

		#+BEGIN_SRC emacs-lisp
      ;; clear the templates list
      (setq org-capture-templates '())
      
      ;; next we start to add the templates we want.
      ;; This is the default one.
      (add-to-list 'org-capture-templates
                   ;; w has special meaning as a default for capture.
                   '("w"
                     "Default template"
                     entry
                     (file+headline "~/org/capture.org" "Notes")
                     "** %^{Title}
         Added: %U
         Source: %c
         %i
      "
                     :empty-lines 1))
      
      ;; This one is called from my integration in outlook throu org-protocol
      ;; Only useful on my workmachine but is not in the way on my home machine
      ;; Placeholders Replacement 
      ;; %:link URL of the email
      ;; %:description The title of the message
      ;; %:title The title of the message 
      ;; %:initial Selected text.
      ;; %:sender Sender's name
      ;; %:sender-email Sender's Email
      (add-to-list 'org-capture-templates
                   '("o"
                     "Outlook integration - creates items from mails."
                     entry
                     (file+headline "c:/Users/jiha.POWELASA/Documents/org/mdms/mdms.org" 
                                    "Inbox")
                     "** TODO %c :%:sender:
         Added: %U
         %?
      ,   #+begin_quote
           %:initial
      ,   #+end_quote
      "
                     :clock-resume
                     :empty-lines 1
                     :prepend))
      
      ;; This template is used to add notes to currently clocked-in work item.
      (add-to-list 'org-capture-templates
                   '("c"
                     "Add note to currently clocked-in item."
                     entry
                     (clock)
                     "** %^{Title}
         Added: %U
         %?"
                     :clock-keep
                     :empty-lines 1
                     :unnarrowed))
      
		#+END_SRC


*** Agenda																																 :habits:agenda:

		#+BEGIN_SRC emacs-lisp
      ;; popup new frame for org-agenda, so we get full width
      ;; it will reuse allready open frame and only pop it front.
      (setq org-agenda-window-setup 'other-frame)
      
      (setq org-agenda-ndays 14)
      (setq org-agenda-repeating-timestamp-show-all nil)
      (setq org-agenda-include-diary t)
      (setq org-agenda-inhibit-startup t)
      (setq org-agenda-clock-consistency-checks 
            (quote (:max-duration "10:00" 
                    :min-duration "00:03" 
                    :max-gap "0:05" 
                    :gap-ok-around ("4:00" "12:00") 
                    :default-face ((:background "DarkRed") 
                                   (:foreground "white")) 
                    :overlap-face nil 
                    :gap-face nil 
                    :no-end-time-face nil 
                    :long-face nil 
                    :short-face nil)))
      (setq org-agenda-clockreport-parameter-plist 
             (quote (:link t :maxlevel 3)))
      (setq org-agenda-dim-blocked-tasks t)
      (setq org-agenda-entry-text-maxlines 3)
      (setq org-agenda-skip-deadline-if-done t)
      (setq org-agenda-skip-scheduled-if-done t)
      (setq org-agenda-time-leading-zero t)
      
      ;; habits, and modification of tags column so it's not in way of habits
      (setq org-habit-graph-column 70)
      (setq org-agenda-tags-column 110)
      (setq org-habit-show-habits-only-for-today nil)
      (setq org-habit-preceding-days 20)
      (setq org-habit-following-days 15)
      
		#+END_SRC

		#+RESULTS:
		: 15

		From Julien Danjou we borrow a function to be able to get our own
		Holidays and Vaction days marked in the right face.	 for this to
		kick in you need to set the category on items to "Holidays" or
		"Vacation".

		#+BEGIN_SRC emacs-lisp
      (setq org-agenda-day-face-function
            (defun jd:org-agenda-day-face-holidays-function (date)
              "Compute DATE face for holidays."
              (unless (org-agenda-todayp date)
                (dolist (file (org-agenda-files nil 'ifmode))
                  (let ((face
                         (dolist (entry (org-agenda-get-day-entries file date))
                           (let ((category (with-temp-buffer
                                             (insert entry)
                                             (org-get-category (point-min)))))
                             (when (or (string= "Holidays" category)
                                       (string= "Vacation" category))
                               (return 'org-agenda-date-weekend))))))
                    (when face (return face)))))))
		#+END_SRC
		
***** Diary integration																						:appt:midnight:calendar:

			functions to use in the agenda view, include calles to these
			functions in one of your agenda files like this %%(diary-sun*) and
			it will be called.
			#+BEGIN_SRC emacs-lisp
        ;; functions to use in the dairy to get seperated sunrise and sunset times.
        ;; if we use %%(dairy-sunrise-sunset) we get it on one line, this gives us
        ;; two lines or only one if we want to.
        (defun diary-sunrise ()
          (let ((dss (diary-sunrise-sunset)))
            (with-temp-buffer
              (insert dss)
              (goto-char (point-min))
              (while (re-search-forward " ([^)]*)" nil t)
                (replace-match "" nil nil))
              (goto-char (point-min))
              (search-forward ",")
              (buffer-substring (point-min) (match-beginning 0)))))
        
        (defun diary-sunset ()
          (let ((dss (diary-sunrise-sunset))
                start end)
            (with-temp-buffer
              (insert dss)
              (goto-char (point-min))
              (while (re-search-forward " ([^)]*)" nil t)
                (replace-match "" nil nil))
              (goto-char (point-min))
              (search-forward ", ")
              (setq start (match-end 0))
              (search-forward " at")
              (setq end (match-beginning 0))
              (goto-char start)
              (capitalize-word 1)
              (buffer-substring start end))))
        
			#+END_SRC
			
			We also need to set where on earth we are because without that
			information the dairy-sun* functions can not do it's job and
			will ask every time we start where on earht we are.

			#+BEGIN_SRC emacs-lisp
        (setq calendar-latitude 63.1766)
        (setq calendar-longitude 14.636068)
        (setq calendar-location-name "Östersund, Sweden")
        
			#+END_SRC

			Midnight hook to get org appointments into the appt reminder things
			
			#+BEGIN_SRC emacs-lisp
        ; on startup
        (org-agenda-to-appt)
        ; every night we update
        (add-hook 'midnight-hook (lambda ()
                                   (org-agenda-to-appt)))
			#+END_SRC

   #+RESULTS:
	 | (lambda nil (org-agenda-to-appt)) | clean-buffer-list |

* Windows context menu integration																								 :instw:
	:LOGBOOK:
	- State "DONE"       from "TODO"  [2013-03-15 fr 10:35]
		works fine
	CLOCK: [2013-03-15 fr 08:11]--[2013-03-15 fr 10:35] =>  2:24
	:END:
	Starting Emacs From Global Context Menu
	
	Here is a simple but useful way to access Emacs. It adds the option to open a file in
	Emacs to your global context menu (i.e., right clicking on a file). This runs a new
	Emacs instance for each file. (Note: not the “Open With” submenu, but the top level
	context menu.) 

	This has been tested under WinXP.

	Create a file of the code below, change paths to were you have emacs installed and run
	it.

	#+BEGIN_SRC conf-windows
    REGEDIT4      
    [HKEY_CLASSES_ROOT\*\shell]
      
    [HKEY_CLASSES_ROOT\*\shell\openwemacs]
    @="&GNU Emacs (client)"
    # The above value appears in the global context menu, 
    # i.e., when you right click on a file.
    # (The '&' makes the next character a shortcut.)
    "Icon"="C:\\users\\jiha\\Emacs-24.1\\bin\\emacs.exe,0"
    # The above uses the icon of the Emacs exe for the context
    # and should match the path used for the command below.
    # The ,0 selects the main icon.
    
    [HKEY_CLASSES_ROOT\*\shell\openwemacs\command]
    @="C:\\users\\jiha\\Emacs-24.1\\bin\\emacsclientw \"%1\""
    # The above has to point to where you install Emacs 
	#+END_SRC

	If it does not work, check the paths one more time.

